IDENTIFICATION DIVISION.
PROGRAM-ID. IMSCBL1
DATA DIVISION.
WORKING-STORAGE SECTION.
 01  CUSTROOT-IO-AREA.
		05 CUSACTNO              	PIC X(8).
		05 CUSNAME         			PIC X(15).
		05 CUSADDR           		PIC X(40).
		05 CUSBLNK          		PIC X(35).

 01  FUNCTION-CODES:
     05 GN-FUNC   PIC X(4) VALUE 'GN  '.
     05 GU-FUNC   PIC X(4) VALUE 'GU  '.
     05 GHU-FUNC  PIC X(4) VALUE 'GHU '.
     05 GNP-FUNC  PIC X(4) VALUE 'GNP '.
     05 GNHP-FUNC PIC X(4) VALUE 'GNHP'. 
     05 DLET-FUNC PIC X(4) VALUE 'DLET'.
     05 ROLB-FUNC PIC X(4) VALUE 'ROLB'.
     05 ISRT-FUNC PIC X(4) VALUE 'ISRT'.

* PUT THE SSA-S HERE
 01 CUSTROOT-SSA-UNQUAL.
     05 FILLER    PIC X(08) VALUE 'CUSTROOT'.
     05 FILLER    PIC X VALUE SPACES.

 01 CUSTROOT-SSA-QUAL.
     05 FILLERPIC X(08) VALUE 'CUSTROOT'.
     05 FILLERPIC X     VALUE '('.
     05 CUSTROOT-SSA-FIELD-NAME PIC X(08) VALUE 'CUSACTNO'.
     05 CUSTROOT-SSA-OPERATOR   PIC X(02) VALUE '= '.
     05 CUSTROOT-SSA-DATA-VALUE PIC X(06) VALUE SPACES.
     05 FILLERPIC X     VALUE ')'.

 
LINKAGE SECTION.
     * THE PCB MASKS, IN THE SAME ORDER AS THE PCB'S IN THE PSB
     * the io pcb mask is normally not needed in a batch program 
     * it is needed in OURS, because the PSB has CMPAT=YES

01 DUMMY-IO-PCB-MASK.
     05 FILLER PIC X(10).
     05 DUMMY-IO-STATUS PIC XX.
     *     NOTE THAT IT IS TOO SHORT, BUT THAT'S OK

01 DATABASE-PCB-MASK.
     05 DBD-NAME  PIC X(8).
     05 SEG-LEVEL PIC X(2).
     05 DATABASE-STATUS PIC X(2).
     05 PROC-OPTIONS    PIC X(4).
     05 RESERVED  PIC S9(5) COMP.
     05 SEGMENT-NAME-FEEDBACK PIC X(8).
     05 LENGTH-KEY-FEEDBACK   PIC S9(5) COMP.
     05 NUM-SENS-SEGS   PIC S9(5) COMP.
* NOTE THAT PIC X(6) IN THE FOLLOWING 
* WILL WORK FOR THE HOBBIES DATABASE, NOT NECESSARILY ANY OTHER
     05 KEY-FEEDBACK    PIC X(6).

*     normally you don't do a USING on procedure division.
*     we have to do it this way, however, 
*     because of the JCL that we used in the workshop.

  PROCEDURE DIVISION 
     USING DUMMY-IO-PCB-MASK,
     DATABASE-PCB-MASK.
	 

    CALL 'CBLTDLI' USING
	GU-FUNC
	DATABASE-PCB-MASK
	CUSTROOT-IO-AREA
	CUSTROOT-SSA-UNQUAL
 
* CHECK STATUS CODE
	EVALUATE DATABASE-STATUS
*	all ok
	WHEN '  '
		DISPLAY 'SUCCESS'
	WHEN 'GA' 
		DISPLAY 'SUCCESS (WENT TO HIGHER LEVEL SEG TYPE)'
	WHEN 'GK'
		DISPLAY 'SUCCESS (SAME LEVEL, DIFF SEG TYPE)' 
*	I can handle it 
	WHEN 'GE'
		DISPLAY 'NOT FOUND'
		MOVE 'Y' TO TIME-TO-STOP-SWITCH
	WHEN 'GB'
		DISPLAY 'END OF DATABASE'
		MOVE 'Y' TO TIME-TO-STOP-SWITCH
	WHEN 'II'
		DISPLAY 'DUPLICATE KEY ON INSERT'
*	disaster 
	WHEN OTHER
		DISPLAY 'UNEXPECTED STATUS CODE IS' DATABASE-STATUS 
		GO TO ERROR-EXIT
	END-EVALUATE.
 
 ERROR-EXIT.
 	DISPLAY 'PROGRAM ABANDONED'
 	EVALUATE DATABASE-STATUS
 	WHEN 'GP'
 		DISPLAY 'PARENTAGE HAS NOT BEEN ESTABLISHED'
 	WHEN 'DJ'
 		DISPLAY 'NO GET HOLD WAS DONE'
 	WHEN 'LB'
 		DISPLAY 'DUPLICATE KEY ON INSERT WITH LOAD PSB'
 	WHEN 'LC'
 		DISPLAY 'KEY OUT OF SEQUENCE ON INSERT WITH LOAD PSB'
 	WHEN 'LD'
 		DISPLAY 'THE QUALIFIED PARENT WAS NOT FOUND '
  DISPLAY 'ON INSERT WITH LOAD PSB'
 	WHEN 'LE' 
 		DISPLAY 'KEY OUT OF SEQUENCE ON INSERT SIBLING '
  DISPLAY 'WITH LOAD PSB'
 	WHEN 'AB'
 		DISPLAY 'IO AREA REQUIRED IN CALL '
 	WHEN 'AC'
 		DISPLAY 'HIERARCHIC ERROR IN SSAS '
 	WHEN 'AD'
 		DISPLAY 'FUNCTION PARAMETER REQUIRED '
 	WHEN 'AH' 
 		DISPLAY 'REQUIRED SSA IS MISSING'
 	WHEN 'AJ'
 		DISPLAY 'SSA QUALIFICATION ERROR'
 	WHEN 'AK'
 		DISPLAY 'FIELD NAME IN SSA IS WRONG '
 	WHEN 'AT'
 		DISPLAY 'IO AREA TOO LONG '
 		DISPLAY 'A GET HOLD CALL WAS NOT DONE'
 	WHEN OTHER
 		DISPLAY 'LOOK UP STATUS CODE USING QUICK REFERENCE'	
 END-EVALUATE
 
 	CALL 'CBLTDLI' USING
 		ROLB-FUNC
 		DUMMY-IO-PCB-MASK.
 
 		GOBACK.