//ADCDMSTR JOB (03SES,SSEA),'RUNJCL',CLASS=A,MSGCLASS=X,
//     NOTIFY=&SYSUID
//STEP1    EXEC PGM=HELLO1
//STEPLIB  DD DSN=IBMUSER.ROBERT.OBJ3,DISP=SHR
//SYSOUT   DD SYSOUT=*
